import re

data = """
০০১. নাম: মোঃ আঙ্গুর ভুইয়া 
০০২. নাম: শ্রী চঞ্চল চন্দ্র শীল\n
ভোটার নং: ৬৮০০১৯০৩৬১০২ 
ভোটার নং: ৬৮০০১৯০৩৬১০৪\nপিতা: মজলু ভূইয়া পিতা: শ্রী জিতেন্দ্র শীল\nমাতা: ফরিদা বেগম মাতা: সন্ধ্যা রানী শিল 
০০৩.\nপেশা: কৃষক,জন্ম তারিখ:০১/০৩/১৯৫৮ 
পেশা: কৃষক,জন্ম তারিখ:১৬/০৫/১৯৬০ কর্তন করা হয়েছে\n
ঠিকানা: দক্ষিন ধুরু, বেলাবো, নরসিংদী 
ঠিকানা: শ্রী চঞ্চল চন্দ্র শীলের বাড়ী, দক্ষিন ধুরু, দক্ষিণ ধুরু,\nবেলাবো, নরসিংদী\n
০০৪. নাম: মোঃ গিয়াস উদ্দিন ভূইয়া 
০০৫. নাম: মোঃ আওলাদ হোসেন ভুইয়া 
০০৬. নাম: মোঃ সোহরাব হোসেন ভূইয়া\n
ভোটার নং: ৬৮০০১৯০৩৬১১২ 
ভোটার নং: ৬৮০০১৯০৩৬১২০ 
ভোটার নং: ৬৮০০১৯০৩৬১২২\n
পিতা: মোঃ মোমতাজ উদ্দিন ভূইয়া 
পিতা: মোঃ রাজি উদ্দিন ভূইয়া 
পিতা: মোঃ হাছেন আলী ভূইয়া\n
মাতা: বাতাসী বেগম 
মাতা: মিসেস রহিমা আক্তার 
মাতা: মোসাঃ ছোফিয়া খাতুন\n
পেশা: বেকার,জন্ম তারিখ:২০/০২/১৯৫২ 
পেশা: বেকার,জন্ম তারিখ:০৮/১২/১৯৮২ 
পেশা: ব্যবসা,জন্ম তারিখ্‌:১০/১২/১৯৮১\n
ঠিকানা: মোঃ গিয়াস উদ্দিনের বাড়ি, দক্ষিন ধুরু, বেলাবো, নরসিংদী ঠিকানা, মোঃ আওলাদ হুসেনর বাড়ি, দক্ষিণ ধুরু, বেলাবো, 
ঠিকানা: মোঃ হাছেন আলীর বাড়ি, দক্ষিন ধুরু, বেলাবো, নরসিংদী\nনরসিং৷\n

০০৭. নাম: আবদুল মজিদ 
০০৮. নাম: মোঃ মাসুদ ভূইয়া 
০০৯. নাম: মোঃ জয়নাল আবেদীন ভূইয়া\n
ভোটার নং: ৬৮০০১৯০৩৬১২৩ 
ভোটার নং: ৬৮০০১৯০৩৬১২৪ 
ভোটার নং: ৬৮৮০০১৯০৩৬১২৭\n
পিতা: মোঃ হাছেন উদ্দিন ভূইয়া 
পিতা: মোঃ আঃ ছাত্তার ভুইয়া 
পিতা: মোঃ মালেক ভূইয়া\n
মাতা: মিসেস সুফিয়া খাতুন 
মাতা: সমুজা বেগম 
মাতা: জোবেদা বেগম\n
পেশা: ব্যবসা,জন্ম তারিখ:২৮/০৫/১৯৭৬ 
পেশা: বেকার,জন্ম তারিখ:০২/০২/১৯৮৯ 
পেশা: কৃষ্ক,জন্ম তারিখ:১৪/০২/১৯৬৩\n
ঠিকানা: আবদুল মজিদের বাড়ি, দক্ষিণ ধুরু, বেলাবো, নরসিংদী 
ঠিকানা: ভুঁইয়া বাড়ী, দক্ষিন ধুরু, দক্ষিন ধুরু, বেলাবো, নরসিংদী ||
ঠিকানা: ভুঁইয়া বাড়ী, দক্ষিণ ধুরু, দক্ষিন ধুরু, বেলাবো, নরসিংদী\n
০১০. নাম: মোঃ আব্দুস ছাত্তার 
০১২. নাম: এনামুল হক ভূইয়া\n
ভোটার নং: ৬৮০০১৯০৩৬১২৯ 
ভোটার নং: ৬৮০০১৯০৩৬১৩২\n
পিতা: মিয়ার উদ্দিন ভুইয়া 
পিতা: মোঃ রাজি উদ্দিন ভূইয়া\n
মাতা: সাহেরা বেগম 
০১১. মাতা: রহিমা আক্তার\nপেশা: কৃষ্ক,জন্ম তারিখ:১০/০৩/১৯৬৯ মাইগ্রেট হয়েছে পেশা: ব্যবসা,জন্ম তারিখ:০৮/১১/১৯৯৩\n
ঠিকানা: ভুইয়ার বাড়ী, দক্ষিণ ধূরু, বেলাবো, নরসিংদী ঠিকানা: ভূইয়ার বাড়ী, দক্ষিণ ধুরু, বেলাবো, নরসিংদী\n
০১৪. নাম: মোঃ জামাল উদ্দিন\nভোটার নং: ৬৮০০১৯০৩৬১৪৭\n
০১৩ পিতা: আঃ মালেক 
০১৫\n
মাতা: শিরিনা আক্তার -\nকর্তন করা হয়েছে 
পেশা: সরকারী চাকুরী,
জন্ম তারিখ:২০/০২/১৯৬৩ মাইগ্রেট হয়েছে\n
ঠিকানা মোঃ জামাল উদ্দিনের বাড়ী, দক্ষিণ ধুরু, বেলাবো,\nনরসিংদী\n১\n\f\nজেলা: নরসিংদী 
l

০১৬. নাম: মোঃ আমান উল্লাহ ভুইয়া 
০১৭. নাম: মোহাম্মদ কামাল হোসেন ভূইয়া\n
ভোটার নং: ৬৮০০১৯০৩৬১৫৩ 
ভোটার নং: ৬৮০০১৯০৩৬১৫৫\n
পিতা: মোঃ সামসুল হুদা ভুইয়া 
পিতা: মোহাম্মদ আমজাদ হোসেন ভূইয়া\n
মাতা: জাহানারা বেগম 
মাতা: রহিমা বেগম ০১৮.\n
পেশা: ছাত্র/ছাত্রী,জন্ম তারিখ:০৪/০১/১৯৮৯ 
পেশা: বেকার,
জন্ম তারিখ:০১/০৪/১৯৮০ মাইগ্রেট হয়েছে\n
ঠিকানা: মৌলভী মোঃ আঃ রাজ্জাক ভূইয়ার বাড়ী, দক্ষিণ yew, 
ঠিকানা: আমজাদ হুসেনের বাড়ি, দক্ষিন ধুরু, বেলাবো, নরসিংদী\nবেলাবো, নরসিংদী\n
০১৯. নাম: মোঃ জাহাঙ্গীর হোসেন 
০২০. নাম: মোঃ হাছেন উদ্দিন ভূইয়া 
০২১. নাম: মোঃ লোকমান হোসেন ভূইয়া\n
ভোটার নং: ৬৮০০১৯০৩৬১৬০ 
ভোটার নং: ৬৮০০১৯০৩৬১৬১ 
ভোটার নং: ৬৮৮০০১৯০৩৬১৬২\n
পিতা: মোঃ মালেক ভুইয়া 
পিতা: আফছর উদ্দিন 
পিতা: মোঃ হাছেন উদ্দিন ভুইয়া\n
মাতা: মোসাঃ জায়েদা খাতুন 
মাতা: গোলছার বেগম 
মাতা: মোসাঃ সুফিয়া খাতুন\n
পেশা: কৃষক,জন্ম তারিখ:০৭/০৮/১৯৭৩ 
পেশা: কৃষক,জন্ম তারিখ:১২/০৭/১৯৪৫ 
পেশা: ব্যবসা,জন্ম তারিখ:১০/১০/১৯৮৪\n
ঠিকানা: মোঃ জাহাঙ্গীর হোসেনের বাড়ী, দক্ষিণ ধূরু, বেলাবো, 
ঠিকানা: মোঃ হাছেন উদ্দিনের বাড়ি, দক্ষিণ ধুরু, বেলাবো, 
ঠিকানা: মোঃ হাছেন উদ্দিন ভূইয়ার বাড়ী, দক্ষিণ ধূরু, বেলাবো,\nনরসিংদী নরসিংদী নরসিংদী\n
০২২. নাম: মোঃ বকুল মিয়া 
০২৩. নাম: মোঃ রমিজ উদ্দিন ভূইয়া 
০২৪. নাম: বেনুজীর আহামেদ\n
ভোটার নং: ৬৮০০১৯০৩৬১৬৩ 
ভোটার নং: ৬৮০০১৯০৩৬১৬৯ 
ভোটার নং: ৬৮০০১৯০৩৬১৭২\n
পিতা: মোঃ হাছেন উদ্দিন ভুইয়া 
পিতা: মহিউদ্দিন ভূঞা 
পিতা: মোখলেছুর রহামান\n
মাতা: মোসাঃ সুফিয়া খাতুন 
মাতা: কানিজা আক্তার খাতুন 
মাতা: হাজেরা বেগম\n
পেশা: কৃষক,জন্ম তারিখ:০৫/১০/১৯৬৫ 
পেশা: কৃষক,জন্ম তারিখ:১১/০৬/১৯৪০ 
পেশা: বেসরকারী চাকুরী,জন্ম তারিখ:০১/০২/১৯৭৯\n
ঠিকানা: মোঃ বকুল মিয়ার বাড়ী, দক্ষিণ ধূরু, বেলাবো, নরসিংদী 
ঠিকানা: রমিজ উদ্দিন ভুইয়ার বাড়ী, দক্ষিনধুর, বেলাবো, নরসিংদী 
ঠিকানা বেনুজীর আহমাদ সাহেবের বাড়ী, দক্ষিন ধুর, বেলাবো,\n> টব\n
০২৬. নাম: মোঃ নাজিম উদ্দিন ভূইয়া 
০২৭. নাম: শ্রী অজিত চন্দ্র শীল\n
ভোটার নং: ৬৮০০১৯০৩৬১৮০ 
ভোটার নং: ৬৮০০১৯০৩৬১৮৩\n
পিতা: মোঃ বোরহান উদ্দিন ভূইয়া
 পিতা: রাম চরন চন্দ্র শীল\nORE. 
 মাতা: রেহেনা বেগম মাতা: সন্ধ্যা রানী\nমাইগ্রেট হয়েছে 
 পেশা: ব্যবসা,জন্ম তারিখ:১২/১০/১৯৮৭ 
 পেশা: অন্যান্য,জন্ম তারিখ:০৬/০৮/১৯৭২\n
 ঠিকানা: মোঃ বোরহান উদ্দিন ভুইয়ার বাড়ি, দক্ষিন ধুরু, বেলাবো, ||
 ঠিকানা: শ্রী অজত চন্দ্র শীলের বাড়ী, দক্ষিন ধুরু, বেলাবো,\nনরসিংদী নরসিংদী\n
 ০২৮. নাম: মোঃ রমিজ উদ্দিন 
 ০২৯. নাম: মোঃ আবু সাইদ 
 ০৩০. নাম: মোঃ ফায়েজ উদ্দিন\n
 ভোটার নং: ৬৮০০১৯০৩৬১৮৫ 
 ভোটার নং: ৬৮০০১৯০৩৬১৮৭ 
 ভোটার নং: ৬৮০০১৯০৩৬১৮৮\n
 পিতা: জুহর আলী ভূইয়া 
 পিতা: আবদুল আলী
পিতা: জহর আলী\n
মাতা: এলাচি 
মাতা: মরিয়ম বেগম 
মাতা: এলার্চি\n
পেশা: কৃষক,জন্ম তারিখ:১০/১১/১৯৭৩ 
পেশা: কৃষক,জন্ম তারিখ:১৫/০৩/১৯৬৬ 
পেশা: কৃষক,জন্ম তারিখ:১৬/০৩/১৯৬২\n
ঠিকানা: মোঃ রমিজ উদ্দিনের বাড়ী, দক্ষিণ ধুরু, বেলাবো, নরসিংদী ||
ঠিকানা: মোঃ আবু ছাইদের বাড়ী, দক্ষিণ ধুরু, বেলাবো, নরসিংদী |[
    ঠিকানা: মোঃ জহর আলীর বাড়ী, দক্ষিণ ধুরু, বেলাবো, নরসিংদী\n
    ০৩১. নাম: মোঃ জহির মিয়া ০৩২. নাম: মোঃ গোলাপ মিয়া 
    ০৩৩. নাম: মোঃ জসিম ভূইয়া\n
    ভোটার নং: ৬৮০০১৯০৩৬১৯২ 
    ভোটার নং: ৬৮০০১৯০৩৬১৯৫ 
    ভোটার নং: ৬৮০০১৯০৩৬১৯৬\n
    পিতা: আবদুল আলী 
    পিতা: আলীমন্দিন 
    পিতা: আলিম উদ্দিন ভূইয়া\n
    মাতা: মরিয়ম বেগম 
    মাতা: বানিজা খাতুন 
    মাতা: মনিছা বেগম\n
    পেশা: কৃষক,
    
    
    
    জন্ম তারিখ:০১/০২/১৯৮৫ 
    পেশা: কৃষক,জন্ম তারিখ:০৯/০৮/১৯৬৯ 
    পেশা: বেসরকারী চাকুরী,জন্ম তারিখ:১০/০৬/১৯৮৪\n
    ঠিকানা: মোঃ জহির মিয়ার বাড়ী, দক্ষিন ধুরু, বেলাবো, নরসিংদী 
    ঠিকানা মোঃ গোলাপ মিয়ার বাড়ি, দক্ষিন ধুরু, বেলাবো, 
    ঠিকানা: মোঃ জসিম ভূইয়ার বাড়ী, দক্ষিন ধুরু, বেলাবো, নরসিংদী sdfgss নরসিংদী
"""
# Define the regex pattern to capture names
name_pattern = r"নাম: (.*?)(?=\n|ভোটার নং:|\nভোটার নং:|\n\nভোটার নং|\s[০১২৩৪৫৬৭৮৯]|[০১২৩৪৫৬৭৮৯]$)"
# name_pattern = r". নাম:\s(.*?)(?=\sভোটার নং:|\s[০১২৩৪৫৬৭৮৯]|[০১২৩৪৫৬৭৮৯]|[A-Z]|$)"
voter_no_pattern = r"(?:ভোটার নং:|\sভোটার নং:) (.*?)(?=\n|ভোটার নং:|\nভোটার নং:|\n\nভোটার নং|পিতা:|$)"
ocupation_pattern = r"পেশা: (.*?)(?=,|,জন্ম তারিখ:|\nজন্ম তারিখ:|\n\nজন্ম তারিখ:|$)"
fathers_pattern = r"পিতা: (.*?)(?=\n|পিতা:|মাতা:|\nমাতা:|\n\nমাতা:|[০১২৩৪৫৬৭৮৯]$)"
mothers_pattern = r"মাতা: (.*?)(?=\-\n|মাতা:|\sভোটার নং:|\n|\nভোটার নং:|\n\nভোটার নং:|\s[০১২৩৪৫৬৭৮৯]|[০১২৩৪৫৬৭৮৯]|[A-Z]|[a-z]|[8]|$)"
dob_pattern = r"(?:জন্ম তারিখ:|,জন্ম তারিখ:|\n\nজন্ম তারিখ)(.*?)(?=\n|মাতা:|ঠিকানা:|মাইগ্রেট|কর্তন|তারিখ্\u200c|\sভোটার নং:|\n$)"
address_pattern = r"(?:ঠিকানা:|ঠিকানা)(.*?)(?=\n|\|\||\||\sভোটার নং:|\n|\nভোটার নং:|\n\nভোটার নং:|\s[০১২৩৪৫৬৭৮৯]|[০১২৩৪৫৬৭৮৯]|[A-Z]|[a-z]|[8]|$)"





# Find all matches
matches1 = re.findall(name_pattern, data)
matches2 = re.findall(voter_no_pattern, data)
matches3 = re.findall(ocupation_pattern, data)
matches4= re.findall(fathers_pattern, data)
matches5 = re.findall(mothers_pattern, data)
matches6 = re.findall(dob_pattern, data)
matches7 = re.findall(address_pattern, data)

# Print the matches
print(len(matches1))
print(len(matches2))
print(len(matches3))
print(len(matches4))
print(len(matches5))
print(len(matches6))
print(len(matches7))

print(matches6)

